In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={
    "name":["asif","kashif","saqib","sabir","tayyab"],
    "marks":[32,32,23,22,43],
    "city":["fsd","rwd","layyah","samundri","lahore"],
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks      city
0    asif     32       fsd
1  kashif     32       rwd
2   saqib     23    layyah
3   sabir     22  samundri
4  tayyab     43    lahore

In [5]:
df.to_csv('index.csv')

In [6]:
df.to_csv('index_false.csv',index=False)

In [7]:
df.head(2)

     name  marks city
0    asif     32  fsd
1  kashif     32  rwd

In [8]:
 df.tail(2)

     name  marks      city
3   sabir     22  samundri
4  tayyab     43    lahore

In [9]:
df.describe()

           marks
count   5.000000
mean   30.400000
std     8.502941
min    22.000000
25%    23.000000
50%    32.000000
75%    32.000000
max    43.000000

In [10]:
asif=pd.read_csv('index.csv')

In [11]:
asif

   Unnamed: 0    name  marks      city
0           0    asif     32       fsd
1           1  kashif     32       rwd
2           2   saqib     23    layyah
3           3   sabir     22  samundri
4           4  tayyab     43    lahore

In [12]:
asif["marks"][1]=438739

C:\Users\User\AppData\Local\Temp\ipykernel_9872\3092866091.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  asif["marks"][1]=438739

In [13]:
asif["marks"][1]

438739

In [14]:
asif.to_csv('asiff.csv')

In [15]:
asif.index=["asif","kashif","saqib","sabir","tayyab"]

In [16]:
asif

        Unnamed: 0    name   marks      city
asif             0    asif      32       fsd
kashif           1  kashif  438739       rwd
saqib            2   saqib      23    layyah
sabir            3   sabir      22  samundri
tayyab           4  tayyab      43    lahore

In [17]:
ser=pd.Series(np.random.rand(32))

In [19]:
ser

0     0.232642
1     0.609050
2     0.877578
3     0.489222
4     0.373723
5     0.968654
6     0.634692
7     0.787342
8     0.110988
9     0.667151
10    0.227998
11    0.446432
12    0.346398
13    0.554388
14    0.999241
15    0.883898
16    0.764495
17    0.379212
18    0.915759
19    0.695539
20    0.591097
21    0.251601
22    0.168552
23    0.237948
24    0.541169
25    0.325436
26    0.482697
27    0.230719
28    0.051942
29    0.064847
30    0.415151
31    0.564686
dtype: float64

In [20]:
type(ser)

pandas.core.series.Series

In [ ]:
dataFrame=pd.DataFrame(np.random.rand(23,5),index=arrange(23,))